#include <stdio.h>


void main()
{
	/************************************************************
	char a[100] = {1};
	char *p = a;
	printf("数组a：地址：%x 取地址：%x\n",a,&a);
	printf("指针p：地址：%x 取地址：%x 解除引用：%d\n",p,&p,*p);
	************************************************************/


	/**********************************************************
	extern char *p;
	char a[] = "abcd";
	printf("指向字符的指针：%s\n字符序列：%s\n",p,a);
	**********************************************************/


	char *p = "abcd";
	char a[] = "efgh";
	*p = 'q';                   //此动作会发生错误，导致程序无法正常运行
	a[0] = 'w';
	printf("修改后的指针p指向的字符串：%s\n",p);
	printf("修改后的数组a代表的字符序列：%s\n",a);
}
